# Fahrenheit Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
UnitTypeId..::..Fahrenheit Property
UnitTypeId Class See Also
---
Fahrenheit.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId Fahrenheit { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property Fahrenheit As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ Fahrenheit {
	ForgeTypeId^ get ();
}
```

# See Also
UnitTypeId Class
Autodesk.Revit.DB Namespace